[Killed] BlockStatement
src/modules/Authentification/saga.ts:7:30
 import { actions } from "./slice";
 
 
-export function* loginSaga() {
-    while (true) {
-        yield take(actions.login.type);
-        const username = yield select(getUsername);
-        yield call(logIn, username);
-        yield take(actions.logout.type);
-        yield call(logOut);
-    }
-}
+export function* loginSaga() {}

[Killed] ConditionalExpression
src/modules/Authentification/saga.ts:8:12
 
 
 export function* loginSaga() {
-    while (true) {
+    while (false) {
         yield take(actions.login.type);
         const username = yield select(getUsername);
