[Killed] ObjectLiteral
src/modules/Authentification/slice.ts:14:15
 const game = createSlice({
     name: "login",
     initialState: initialState,
-    reducers: {
-        login: (state, action: PayloadAction<string>) => {
-            state.username = action.payload;
-        },
-        logout: (state) => {
-            state.username = "";
-        },
-        setUsername: (state, action: PayloadAction<string>) => {
-            state.username = action.payload;
-        },
-    }
+    reducers: {}
 });
 

[Killed] BlockStatement
src/modules/Authentification/slice.ts:15:58
     name: "login",
     initialState: initialState,
     reducers: {
-        login: (state, action: PayloadAction<string>) => {
-            state.username = action.payload;
-        },
+        login: (state, action: PayloadAction<string>) => {},
         logout: (state) => {
             state.username = "";

[Killed] BlockStatement
src/modules/Authentification/slice.ts:18:28
         login: (state, action: PayloadAction<string>) => {
             state.username = action.payload;
         },
-        logout: (state) => {
-            state.username = "";
-        },
+        logout: (state) => {},
         setUsername: (state, action: PayloadAction<string>) => {
             state.username = action.payload;

[Survived] BlockStatement
src/modules/Authentification/slice.ts:21:64
         logout: (state) => {
             state.username = "";
         },
-        setUsername: (state, action: PayloadAction<string>) => {
-            state.username = action.payload;
-        },
+        setUsername: (state, action: PayloadAction<string>) => {},
     }
 });
