[Killed] ArrowFunction
src/modules/Authentification/selector.ts:3:28
 import { StoreState } from "@/store/store";
 
-export const getUsername = ({ loginReducer }: StoreState): string => loginReducer.username;
+export const getUsername = () => undefined;
