[Killed] BlockStatement
src/modules/Game/saga.ts:6:30
 import { actions } from "./slice";
 
 
-export function* startGame() {
-    while (true) {
-        const speed: number = yield select(getSpeed);
-        yield put(actions.update());
-        yield delay(speed);
-    }
-}
+export function* startGame() {}
 
 export function* gameSaga() {

[Killed] ConditionalExpression
src/modules/Game/saga.ts:7:12
 
 
 export function* startGame() {
-    while (true) {
+    while (false) {
         const speed: number = yield select(getSpeed);
         yield put(actions.update());

[Killed] BlockStatement
src/modules/Game/saga.ts:14:29
     }
 }
 
-export function* gameSaga() {
-    while (true) {
-        yield take(actions.start.type);
-        const task = yield fork(startGame);
-        yield take(actions.stop.type);
-        yield cancel(task);
-    }
-}
+export function* gameSaga() {}

[Killed] ConditionalExpression
src/modules/Game/saga.ts:15:12
 }
 
 export function* gameSaga() {
-    while (true) {
+    while (false) {
         yield take(actions.start.type);
         const task = yield fork(startGame);
