[Killed] ArrowFunction
src/modules/Game/selector.ts:4:25
 import { StoreState } from "@/store/store";
 import { BoardType } from "@/types";
 
-export const getBoard = ({ gameReducer }: StoreState): BoardType => gameReducer.board;
+export const getBoard = () => undefined;
 
 export const getSpeed = ({ gameReducer }: StoreState): number => gameReducer.speed;

[Killed] ArrowFunction
src/modules/Game/selector.ts:6:25
 
 export const getBoard = ({ gameReducer }: StoreState): BoardType => gameReducer.board;
 
-export const getSpeed = ({ gameReducer }: StoreState): number => gameReducer.speed;
+export const getSpeed = () => undefined;
