[Survived] ArrayDeclaration
src/modules/Game/slice.ts:14:12
 }
 
 export const initialState: GameState = {
-    board: new Array(),
+    board: new Array([]),
     isRunning: false,
     population: 0.1,

[Survived] BooleanLiteral
src/modules/Game/slice.ts:15:16
 
 export const initialState: GameState = {
     board: new Array(),
-    isRunning: false,
+    isRunning: true,
     population: 0.1,
     speed: 700

[Killed] BlockStatement
src/modules/Game/slice.ts:24:73
     name: "game",
     initialState: initialState,
     reducers: {
-        toggleAlive: (state, { payload }: PayloadAction<Coordinate>) => {
-            const { x, y } = { ...payload };
-            let cell = state.board[x][y];
-            cell.alive = !cell.alive;
-        },
+        toggleAlive: (state, { payload }: PayloadAction<Coordinate>) => {},
         fillInBoardRandom: (state) => {
             state.board = makeGrid(true, state.population);

[Killed] BooleanLiteral
src/modules/Game/slice.ts:27:26
         toggleAlive: (state, { payload }: PayloadAction<Coordinate>) => {
             const { x, y } = { ...payload };
             let cell = state.board[x][y];
-            cell.alive = !cell.alive;
+            cell.alive = cell.alive;
         },
         fillInBoardRandom: (state) => {

[Survived] BlockStatement
src/modules/Game/slice.ts:29:39
             let cell = state.board[x][y];
             cell.alive = !cell.alive;
         },
-        fillInBoardRandom: (state) => {
-            state.board = makeGrid(true, state.population);
-        },
+        fillInBoardRandom: (state) => {},
         start: (state) => {
             state.isRunning = true;

[Survived] BooleanLiteral
src/modules/Game/slice.ts:30:36
             cell.alive = !cell.alive;
         },
         fillInBoardRandom: (state) => {
-            state.board = makeGrid(true, state.population);
+            state.board = makeGrid(false, state.population);
         },
         start: (state) => {

[Killed] BlockStatement
src/modules/Game/slice.ts:32:27
         fillInBoardRandom: (state) => {
             state.board = makeGrid(true, state.population);
         },
-        start: (state) => {
-            state.isRunning = true;
-        },
+        start: (state) => {},
         update: (state) => {
             state.board = updateGameField(state.board);

[Killed] BooleanLiteral
src/modules/Game/slice.ts:33:31
             state.board = makeGrid(true, state.population);
         },
         start: (state) => {
-            state.isRunning = true;
+            state.isRunning = false;
         },
         update: (state) => {

[Killed] BlockStatement
src/modules/Game/slice.ts:35:28
         start: (state) => {
             state.isRunning = true;
         },
-        update: (state) => {
-            state.board = updateGameField(state.board);
-        },
+        update: (state) => {},
         stop: (state) => {
             state.isRunning = false;

[Survived] BlockStatement
src/modules/Game/slice.ts:38:26
         update: (state) => {
             state.board = updateGameField(state.board);
         },
-        stop: (state) => {
-            state.isRunning = false;
-        },
+        stop: (state) => {},
         clear: (state) => {
             state.board = makeGrid(false);

[Killed] BooleanLiteral
src/modules/Game/slice.ts:39:31
             state.board = updateGameField(state.board);
         },
         stop: (state) => {
-            state.isRunning = false;
+            state.isRunning = true;
         },
         clear: (state) => {

[Killed] BlockStatement
src/modules/Game/slice.ts:41:27
         stop: (state) => {
             state.isRunning = false;
         },
-        clear: (state) => {
-            state.board = makeGrid(false);
-        },
+        clear: (state) => {},
 
         setPopulation: (state, action: PayloadAction<number>) => {

[Killed] BooleanLiteral
src/modules/Game/slice.ts:42:36
             state.isRunning = false;
         },
         clear: (state) => {
-            state.board = makeGrid(false);
+            state.board = makeGrid(true);
         },
 

[Killed] BlockStatement
src/modules/Game/slice.ts:45:66
             state.board = makeGrid(false);
         },
 
-        setPopulation: (state, action: PayloadAction<number>) => {
-            state.population = (action.payload / 100);
-        },
+        setPopulation: (state, action: PayloadAction<number>) => {},
         setSpeed: (state, action: PayloadAction<number>) => {
             state.speed = ((100 - action.payload) * 10);

[Killed] ArithmeticOperator
src/modules/Game/slice.ts:46:33
         },
 
         setPopulation: (state, action: PayloadAction<number>) => {
-            state.population = (action.payload / 100);
+            state.population = (action.payload * 100);
         },
         setSpeed: (state, action: PayloadAction<number>) => {

[Killed] BlockStatement
src/modules/Game/slice.ts:48:61
         setPopulation: (state, action: PayloadAction<number>) => {
             state.population = (action.payload / 100);
         },
-        setSpeed: (state, action: PayloadAction<number>) => {
-            state.speed = ((100 - action.payload) * 10);
-        },
+        setSpeed: (state, action: PayloadAction<number>) => {},
         insertPattern: (state, action: PayloadAction<number>) => {
             state.board = makeGrid(false);

[Killed] ArithmeticOperator
src/modules/Game/slice.ts:49:29
             state.population = (action.payload / 100);
         },
         setSpeed: (state, action: PayloadAction<number>) => {
-            state.speed = ((100 - action.payload) * 10);
+            state.speed = ((100 + action.payload) * 10);
         },
         insertPattern: (state, action: PayloadAction<number>) => {

[Killed] ArithmeticOperator
src/modules/Game/slice.ts:49:28
             state.population = (action.payload / 100);
         },
         setSpeed: (state, action: PayloadAction<number>) => {
-            state.speed = ((100 - action.payload) * 10);
+            state.speed = ((100 - action.payload) / 10);
         },
         insertPattern: (state, action: PayloadAction<number>) => {

[Killed] BlockStatement
src/modules/Game/slice.ts:51:66
         setSpeed: (state, action: PayloadAction<number>) => {
             state.speed = ((100 - action.payload) * 10);
         },
-        insertPattern: (state, action: PayloadAction<number>) => {
-            state.board = makeGrid(false);
-            insertPatterntToBoard(state.board, action.payload)
-        },
+        insertPattern: (state, action: PayloadAction<number>) => {},
     }
 });

[Killed] BooleanLiteral
src/modules/Game/slice.ts:52:36
             state.speed = ((100 - action.payload) * 10);
         },
         insertPattern: (state, action: PayloadAction<number>) => {
-            state.board = makeGrid(false);
+            state.board = makeGrid(true);
             insertPatterntToBoard(state.board, action.payload)
         },
