[Survived] ObjectLiteral
GameOfLife/src/store/store.ts:9:33
 import { reducer as loginReducer } from '@/modules/Authentification/slice';
 import { loginSaga } from "@/modules/Authentification/saga";
 
-const reducer = combineReducers({
-    gameReducer,
-    loginReducer
-});
+const reducer = combineReducers({});
 
 export type StoreState = ReturnType<typeof reducer>;

[Survived] BlockStatement
GameOfLife/src/store/store.ts:16:22
 
 export type StoreState = ReturnType<typeof reducer>;
 
-function* rootSaga() {
-    yield fork(gameSaga);
-    yield fork(loginSaga);
-}
+function* rootSaga() {}
 
 const sagaMiddleware = createSagaMiddleware();

[Survived] ObjectLiteral
GameOfLife/src/store/store.ts:23:37
 
 const sagaMiddleware = createSagaMiddleware();
 
-export const store = configureStore({
-    reducer,
-    middleware: [sagaMiddleware]
-});
+export const store = configureStore({});
 
 sagaMiddleware.run(rootSaga);

[Survived] ArrayDeclaration
GameOfLife/src/store/store.ts:25:17
 
 export const store = configureStore({
     reducer,
-    middleware: [sagaMiddleware]
+    middleware: []
 });
 
