[Killed] BlockStatement
GameOfLife/src/utils/GameUtil.ts:4:112
 import { BoardType, CellType, Coordinate } from "@/types";
 import { patterns } from "./PatternUtil";
 
-export const makeGrid = (random = false, population = 0.1, height = 30, width = 30): Array<Array<CellType>> => {
-    let grid = new Array();
-    for (var i = 0; i < height; i++) {
-        var row = new Array();
-        for (var j = 0; j < width; j++) {
-            let cell;
-            if (random) {
-                cell = Math.random() < population;
-            } else {
-                cell = false;
-            }
-            row.push({
-                alive: cell
-            });
-        }
-        grid.push(row);
-    }
-    return grid;
-};
+export const makeGrid = (random = false, population = 0.1, height = 30, width = 30): Array<Array<CellType>> => {};
 
 const _getAliveNeighboreCount = (coordinate: Coordinate, board: BoardType) => {

[Killed] BooleanLiteral
GameOfLife/src/utils/GameUtil.ts:4:35
 import { BoardType, CellType, Coordinate } from "@/types";
 import { patterns } from "./PatternUtil";
 
-export const makeGrid = (random = false, population = 0.1, height = 30, width = 30): Array<Array<CellType>> => {
+export const makeGrid = (random = true, population = 0.1, height = 30, width = 30): Array<Array<CellType>> => {
     let grid = new Array();
     for (var i = 0; i < height; i++) {

[Killed] EqualityOperator
GameOfLife/src/utils/GameUtil.ts:6:21
 
 export const makeGrid = (random = false, population = 0.1, height = 30, width = 30): Array<Array<CellType>> => {
     let grid = new Array();
-    for (var i = 0; i < height; i++) {
+    for (var i = 0; i >= height; i++) {
         var row = new Array();
         for (var j = 0; j < width; j++) {

[Killed] ConditionalExpression
GameOfLife/src/utils/GameUtil.ts:6:21
 
 export const makeGrid = (random = false, population = 0.1, height = 30, width = 30): Array<Array<CellType>> => {
     let grid = new Array();
-    for (var i = 0; i < height; i++) {
+    for (var i = 0; false; i++) {
         var row = new Array();
         for (var j = 0; j < width; j++) {

[Killed] ArrayDeclaration
GameOfLife/src/utils/GameUtil.ts:7:19
 export const makeGrid = (random = false, population = 0.1, height = 30, width = 30): Array<Array<CellType>> => {
     let grid = new Array();
     for (var i = 0; i < height; i++) {
-        var row = new Array();
+        var row = new Array([]);
         for (var j = 0; j < width; j++) {
             let cell;

[Killed] BlockStatement
GameOfLife/src/utils/GameUtil.ts:8:41
     let grid = new Array();
     for (var i = 0; i < height; i++) {
         var row = new Array();
-        for (var j = 0; j < width; j++) {
-            let cell;
-            if (random) {
-                cell = Math.random() < population;
-            } else {
-                cell = false;
-            }
-            row.push({
-                alive: cell
-            });
-        }
+        for (var j = 0; j < width; j++) {}
         grid.push(row);
     }

[Killed] EqualityOperator
GameOfLife/src/utils/GameUtil.ts:8:25
     let grid = new Array();
     for (var i = 0; i < height; i++) {
         var row = new Array();
-        for (var j = 0; j < width; j++) {
+        for (var j = 0; j >= width; j++) {
             let cell;
             if (random) {

[Killed] ConditionalExpression
GameOfLife/src/utils/GameUtil.ts:10:17
         var row = new Array();
         for (var j = 0; j < width; j++) {
             let cell;
-            if (random) {
+            if (true) {
                 cell = Math.random() < population;
             } else {

[Survived] BlockStatement
GameOfLife/src/utils/GameUtil.ts:10:25
         var row = new Array();
         for (var j = 0; j < width; j++) {
             let cell;
-            if (random) {
-                cell = Math.random() < population;
-            } else {
+            if (random) {} else {
                 cell = false;
             }

[Timeout] ConditionalExpression
GameOfLife/src/utils/GameUtil.ts:11:24
         for (var j = 0; j < width; j++) {
             let cell;
             if (random) {
-                cell = Math.random() < population;
+                cell = false;
             } else {
                 cell = false;

[Survived] EqualityOperator
GameOfLife/src/utils/GameUtil.ts:11:24
         for (var j = 0; j < width; j++) {
             let cell;
             if (random) {
-                cell = Math.random() < population;
+                cell = Math.random() <= population;
             } else {
                 cell = false;

[Survived] BlockStatement
GameOfLife/src/utils/GameUtil.ts:12:20
             let cell;
             if (random) {
                 cell = Math.random() < population;
-            } else {
-                cell = false;
-            }
+            } else {}
             row.push({
                 alive: cell

[Killed] BooleanLiteral
GameOfLife/src/utils/GameUtil.ts:13:24
             if (random) {
                 cell = Math.random() < population;
             } else {
-                cell = false;
+                cell = true;
             }
             row.push({

[Survived] ObjectLiteral
GameOfLife/src/utils/GameUtil.ts:15:22
             } else {
                 cell = false;
             }
-            row.push({
-                alive: cell
-            });
+            row.push({});
         }
         grid.push(row);

[Killed] ConditionalExpression
GameOfLife/src/utils/GameUtil.ts:31:18
     const height = board.length;
     const width = board[0].length
 
-    let topRow = x - 1 < 0 ? (height - 1) : x - 1;
+    let topRow = false ? (height - 1) : x - 1;
     let bottomRow = (x + 1 === height) ? 0 : x + 1;
     let leftColumn = y - 1 < 0 ? (width - 1) : y - 1;

[Killed] EqualityOperator
GameOfLife/src/utils/GameUtil.ts:31:18
     const height = board.length;
     const width = board[0].length
 
-    let topRow = x - 1 < 0 ? (height - 1) : x - 1;
+    let topRow = x - 1 <= 0 ? (height - 1) : x - 1;
     let bottomRow = (x + 1 === height) ? 0 : x + 1;
     let leftColumn = y - 1 < 0 ? (width - 1) : y - 1;

[Killed] ArithmeticOperator
GameOfLife/src/utils/GameUtil.ts:32:46
     const width = board[0].length
 
     let topRow = x - 1 < 0 ? (height - 1) : x - 1;
-    let bottomRow = (x + 1 === height) ? 0 : x + 1;
+    let bottomRow = (x + 1 === height) ? 0 : x - 1;
     let leftColumn = y - 1 < 0 ? (width - 1) : y - 1;
     let rightColumn = (y + 1 === width) ? 0 : y + 1;

[Killed] ConditionalExpression
GameOfLife/src/utils/GameUtil.ts:32:22
     const width = board[0].length
 
     let topRow = x - 1 < 0 ? (height - 1) : x - 1;
-    let bottomRow = (x + 1 === height) ? 0 : x + 1;
+    let bottomRow = (true) ? 0 : x + 1;
     let leftColumn = y - 1 < 0 ? (width - 1) : y - 1;
     let rightColumn = (y + 1 === width) ? 0 : y + 1;

[Killed] EqualityOperator
GameOfLife/src/utils/GameUtil.ts:33:22
 
     let topRow = x - 1 < 0 ? (height - 1) : x - 1;
     let bottomRow = (x + 1 === height) ? 0 : x + 1;
-    let leftColumn = y - 1 < 0 ? (width - 1) : y - 1;
+    let leftColumn = y - 1 <= 0 ? (width - 1) : y - 1;
     let rightColumn = (y + 1 === width) ? 0 : y + 1;
 

[Killed] ArithmeticOperator
GameOfLife/src/utils/GameUtil.ts:33:22
 
     let topRow = x - 1 < 0 ? (height - 1) : x - 1;
     let bottomRow = (x + 1 === height) ? 0 : x + 1;
-    let leftColumn = y - 1 < 0 ? (width - 1) : y - 1;
+    let leftColumn = y + 1 < 0 ? (width - 1) : y - 1;
     let rightColumn = (y + 1 === width) ? 0 : y + 1;
 

[Killed] ConditionalExpression
GameOfLife/src/utils/GameUtil.ts:34:24
     let topRow = x - 1 < 0 ? (height - 1) : x - 1;
     let bottomRow = (x + 1 === height) ? 0 : x + 1;
     let leftColumn = y - 1 < 0 ? (width - 1) : y - 1;
-    let rightColumn = (y + 1 === width) ? 0 : y + 1;
+    let rightColumn = (true) ? 0 : y + 1;
 
     const getNumberFromBoolean = (x: number, y: number): number => {

[Killed] ArithmeticOperator
GameOfLife/src/utils/GameUtil.ts:34:47
     let topRow = x - 1 < 0 ? (height - 1) : x - 1;
     let bottomRow = (x + 1 === height) ? 0 : x + 1;
     let leftColumn = y - 1 < 0 ? (width - 1) : y - 1;
-    let rightColumn = (y + 1 === width) ? 0 : y + 1;
+    let rightColumn = (y + 1 === width) ? 0 : y - 1;
 
     const getNumberFromBoolean = (x: number, y: number): number => {

[Killed] BlockStatement
GameOfLife/src/utils/GameUtil.ts:36:68
     let leftColumn = y - 1 < 0 ? (width - 1) : y - 1;
     let rightColumn = (y + 1 === width) ? 0 : y + 1;
 
-    const getNumberFromBoolean = (x: number, y: number): number => {
-        return Number(board[x][y].alive);
-    }
+    const getNumberFromBoolean = (x: number, y: number): number => {}
 
     neightboreCount += getNumberFromBoolean(topRow, leftColumn);

[Killed] EqualityOperator
GameOfLife/src/utils/GameUtil.ts:57:21
     const width = board[0].length;
 
     const newBoard = new Array();
-    for (let i = 0; i < height; i++) {
+    for (let i = 0; i <= height; i++) {
         const row = new Array<CellType>();
 

[Killed] ConditionalExpression
GameOfLife/src/utils/GameUtil.ts:57:21
     const width = board[0].length;
 
     const newBoard = new Array();
-    for (let i = 0; i < height; i++) {
+    for (let i = 0; false; i++) {
         const row = new Array<CellType>();
 

[Killed] EqualityOperator
GameOfLife/src/utils/GameUtil.ts:60:25
     for (let i = 0; i < height; i++) {
         const row = new Array<CellType>();
 
-        for (let j = 0; j < width; j++) {
+        for (let j = 0; j <= width; j++) {
             const isAlive = board[i][j].alive;
             const aliveNeighboreCount = _getAliveNeighboreCount({ x: i, y: j }, board);

[Killed] ConditionalExpression
GameOfLife/src/utils/GameUtil.ts:60:25
     for (let i = 0; i < height; i++) {
         const row = new Array<CellType>();
 
-        for (let j = 0; j < width; j++) {
+        for (let j = 0; false; j++) {
             const isAlive = board[i][j].alive;
             const aliveNeighboreCount = _getAliveNeighboreCount({ x: i, y: j }, board);

[Survived] BlockStatement
GameOfLife/src/utils/GameUtil.ts:63:26
         for (let j = 0; j < width; j++) {
             const isAlive = board[i][j].alive;
             const aliveNeighboreCount = _getAliveNeighboreCount({ x: i, y: j }, board);
-            if (isAlive) {
-                if (aliveNeighboreCount < 2 || aliveNeighboreCount > 3) {
-                    row.push({ alive: false });
-                } else {
-                    row.push({ alive: true });
-                }
-            } else {
+            if (isAlive) {} else {
                 if (aliveNeighboreCount == 3) {
                     row.push({ alive: true });

[Survived] ConditionalExpression
GameOfLife/src/utils/GameUtil.ts:63:17
         for (let j = 0; j < width; j++) {
             const isAlive = board[i][j].alive;
             const aliveNeighboreCount = _getAliveNeighboreCount({ x: i, y: j }, board);
-            if (isAlive) {
+            if (true) {
                 if (aliveNeighboreCount < 2 || aliveNeighboreCount > 3) {
                     row.push({ alive: false });

[Survived] EqualityOperator
GameOfLife/src/utils/GameUtil.ts:64:21
             const isAlive = board[i][j].alive;
             const aliveNeighboreCount = _getAliveNeighboreCount({ x: i, y: j }, board);
             if (isAlive) {
-                if (aliveNeighboreCount < 2 || aliveNeighboreCount > 3) {
+                if (aliveNeighboreCount <= 2 || aliveNeighboreCount > 3) {
                     row.push({ alive: false });
                 } else {

[Survived] EqualityOperator
GameOfLife/src/utils/GameUtil.ts:64:21
             const isAlive = board[i][j].alive;
             const aliveNeighboreCount = _getAliveNeighboreCount({ x: i, y: j }, board);
             if (isAlive) {
-                if (aliveNeighboreCount < 2 || aliveNeighboreCount > 3) {
+                if (aliveNeighboreCount >= 2 || aliveNeighboreCount > 3) {
                     row.push({ alive: false });
                 } else {

[Survived] BooleanLiteral
GameOfLife/src/utils/GameUtil.ts:65:39
             const aliveNeighboreCount = _getAliveNeighboreCount({ x: i, y: j }, board);
             if (isAlive) {
                 if (aliveNeighboreCount < 2 || aliveNeighboreCount > 3) {
-                    row.push({ alive: false });
+                    row.push({ alive: true });
                 } else {
                     row.push({ alive: true });

[Survived] BlockStatement
GameOfLife/src/utils/GameUtil.ts:66:24
             if (isAlive) {
                 if (aliveNeighboreCount < 2 || aliveNeighboreCount > 3) {
                     row.push({ alive: false });
-                } else {
-                    row.push({ alive: true });
-                }
+                } else {}
             } else {
                 if (aliveNeighboreCount == 3) {

[Survived] BooleanLiteral
GameOfLife/src/utils/GameUtil.ts:67:39
                 if (aliveNeighboreCount < 2 || aliveNeighboreCount > 3) {
                     row.push({ alive: false });
                 } else {
-                    row.push({ alive: true });
+                    row.push({ alive: false });
                 }
             } else {

[Killed] BlockStatement
GameOfLife/src/utils/GameUtil.ts:69:20
                 } else {
                     row.push({ alive: true });
                 }
-            } else {
-                if (aliveNeighboreCount == 3) {
-                    row.push({ alive: true });
-                } else {
-                    row.push({ alive: false });
-                }
-            }
+            } else {}
         }
         newBoard.push(row);

[Killed] ConditionalExpression
GameOfLife/src/utils/GameUtil.ts:70:21
                     row.push({ alive: true });
                 }
             } else {
-                if (aliveNeighboreCount == 3) {
+                if (false) {
                     row.push({ alive: true });
                 } else {

[Killed] EqualityOperator
GameOfLife/src/utils/GameUtil.ts:70:21
                     row.push({ alive: true });
                 }
             } else {
-                if (aliveNeighboreCount == 3) {
+                if (aliveNeighboreCount != 3) {
                     row.push({ alive: true });
                 } else {

[Killed] BooleanLiteral
GameOfLife/src/utils/GameUtil.ts:71:39
                 }
             } else {
                 if (aliveNeighboreCount == 3) {
-                    row.push({ alive: true });
+                    row.push({ alive: false });
                 } else {
                     row.push({ alive: false });

[Survived] BlockStatement
GameOfLife/src/utils/GameUtil.ts:72:24
             } else {
                 if (aliveNeighboreCount == 3) {
                     row.push({ alive: true });
-                } else {
-                    row.push({ alive: false });
-                }
+                } else {}
             }
         }

[Survived] BooleanLiteral
GameOfLife/src/utils/GameUtil.ts:73:39
                 if (aliveNeighboreCount == 3) {
                     row.push({ alive: true });
                 } else {
-                    row.push({ alive: false });
+                    row.push({ alive: true });
                 }
             }

[Survived] BlockStatement
GameOfLife/src/utils/GameUtil.ts:82:79
     return newBoard;
 }
 
-export const insertPatterntToBoard = (board: BoardType, patternId: number) => {
-    const height = board.length;
-    const width = board[0].length;
-    const points = patterns.find((p) => p.id == patternId)?.points;
-    console.log(points);
-
-    if (points !== undefined) {
-        const x = Math.ceil(width / 2);
-        const y = Math.ceil(height / 2);
-
-        points.forEach((point) => {
-            board[x + point.x][y + point.y].alive = true;
-        })
-    }
-}
+export const insertPatterntToBoard = (board: BoardType, patternId: number) => {}
 
 

[Survived] ConditionalExpression
GameOfLife/src/utils/GameUtil.ts:85:41
 export const insertPatterntToBoard = (board: BoardType, patternId: number) => {
     const height = board.length;
     const width = board[0].length;
-    const points = patterns.find((p) => p.id == patternId)?.points;
+    const points = patterns.find((p) => false)?.points;
     console.log(points);
 

[Survived] ConditionalExpression
GameOfLife/src/utils/GameUtil.ts:85:41
 export const insertPatterntToBoard = (board: BoardType, patternId: number) => {
     const height = board.length;
     const width = board[0].length;
-    const points = patterns.find((p) => p.id == patternId)?.points;
+    const points = patterns.find((p) => true)?.points;
     console.log(points);
 

[Survived] BlockStatement
GameOfLife/src/utils/GameUtil.ts:88:31
     const points = patterns.find((p) => p.id == patternId)?.points;
     console.log(points);
 
-    if (points !== undefined) {
-        const x = Math.ceil(width / 2);
-        const y = Math.ceil(height / 2);
-
-        points.forEach((point) => {
-            board[x + point.x][y + point.y].alive = true;
-        })
-    }
+    if (points !== undefined) {}
 }
 

[Survived] EqualityOperator
GameOfLife/src/utils/GameUtil.ts:88:9
     const points = patterns.find((p) => p.id == patternId)?.points;
     console.log(points);
 
-    if (points !== undefined) {
+    if (points === undefined) {
         const x = Math.ceil(width / 2);
         const y = Math.ceil(height / 2);

[Killed] ArithmeticOperator
GameOfLife/src/utils/GameUtil.ts:89:29
     console.log(points);
 
     if (points !== undefined) {
-        const x = Math.ceil(width / 2);
+        const x = Math.ceil(width * 2);
         const y = Math.ceil(height / 2);
 

[Killed] ArithmeticOperator
GameOfLife/src/utils/GameUtil.ts:90:29
 
     if (points !== undefined) {
         const x = Math.ceil(width / 2);
-        const y = Math.ceil(height / 2);
+        const y = Math.ceil(height * 2);
 
         points.forEach((point) => {

[Survived] BlockStatement
GameOfLife/src/utils/GameUtil.ts:92:35
         const x = Math.ceil(width / 2);
         const y = Math.ceil(height / 2);
 
-        points.forEach((point) => {
-            board[x + point.x][y + point.y].alive = true;
-        })
+        points.forEach((point) => {})
     }
 }

[Survived] ArithmeticOperator
GameOfLife/src/utils/GameUtil.ts:93:32
         const y = Math.ceil(height / 2);
 
         points.forEach((point) => {
-            board[x + point.x][y + point.y].alive = true;
+            board[x + point.x][y - point.y].alive = true;
         })
     }

[Survived] BooleanLiteral
GameOfLife/src/utils/GameUtil.ts:93:53
         const y = Math.ceil(height / 2);
 
         points.forEach((point) => {
-            board[x + point.x][y + point.y].alive = true;
+            board[x + point.x][y + point.y].alive = false;
         })
     }
