[Survived] BlockStatement
GameOfLife/src/utils/LogInUtil.ts:1:50
-export const logIn = async (username: string) => {
-    localStorage.setItem('username', username);
-}
+export const logIn = async (username: string) => {}
 
 export const logOut = async () => {

[Survived] BlockStatement
GameOfLife/src/utils/LogInUtil.ts:5:35
     localStorage.setItem('username', username);
 }
 
-export const logOut = async () => {
-    localStorage.removeItem("username");
-}
+export const logOut = async () => {}
 
 export const isUserLoggedIn = (): boolean => {

[Survived] StringLiteral
GameOfLife/src/utils/LogInUtil.ts:6:29
 }
 
 export const logOut = async () => {
-    localStorage.removeItem("username");
+    localStorage.removeItem("");
 }
 

[Survived] BlockStatement
GameOfLife/src/utils/LogInUtil.ts:9:46
     localStorage.removeItem("username");
 }
 
-export const isUserLoggedIn = (): boolean => {
-    const uesrname = localStorage.getItem('username');
-    return Boolean(uesrname);
-}
+export const isUserLoggedIn = (): boolean => {}
 
 export const getUsername = async (): Promise<string> => {

[Survived] BlockStatement
GameOfLife/src/utils/LogInUtil.ts:14:57
     return Boolean(uesrname);
 }
 
-export const getUsername = async (): Promise<string> => {
-    const username = localStorage.getItem('username');
-    return username !== null ? username : '';
-}
+export const getUsername = async (): Promise<string> => {}

[Survived] StringLiteral
GameOfLife/src/utils/LogInUtil.ts:15:43
 }
 
 export const getUsername = async (): Promise<string> => {
-    const username = localStorage.getItem('username');
+    const username = localStorage.getItem("");
     return username !== null ? username : '';
 }

[Survived] ConditionalExpression
GameOfLife/src/utils/LogInUtil.ts:16:12
 
 export const getUsername = async (): Promise<string> => {
     const username = localStorage.getItem('username');
-    return username !== null ? username : '';
+    return false ? username : '';
 }

[Survived] EqualityOperator
GameOfLife/src/utils/LogInUtil.ts:16:12
 
 export const getUsername = async (): Promise<string> => {
     const username = localStorage.getItem('username');
-    return username !== null ? username : '';
+    return username === null ? username : '';
 }
