[Survived] ObjectLiteral
GameOfLife/src/utils/PatternUtil.ts:5:29
 
 
 
-const glider: PatternType = {
-    id: 1,
-    name: "Glider",
-    points: [{ x: -1, y: 0 }, { x: 0, y: 1 }, { x: 1, y: - 1 }, { x: 1, y: 0 }, { x: 1, y: 1 }]
-};
+const glider: PatternType = {};
 
 const exploder: PatternType = {

[Survived] StringLiteral
GameOfLife/src/utils/PatternUtil.ts:7:11
 
 const glider: PatternType = {
     id: 1,
-    name: "Glider",
+    name: "",
     points: [{ x: -1, y: 0 }, { x: 0, y: 1 }, { x: 1, y: - 1 }, { x: 1, y: 0 }, { x: 1, y: 1 }]
 };

[Survived] UnaryOperator
GameOfLife/src/utils/PatternUtil.ts:8:58
 const glider: PatternType = {
     id: 1,
     name: "Glider",
-    points: [{ x: -1, y: 0 }, { x: 0, y: 1 }, { x: 1, y: - 1 }, { x: 1, y: 0 }, { x: 1, y: 1 }]
+    points: [{ x: -1, y: 0 }, { x: 0, y: 1 }, { x: 1, y: +1 }, { x: 1, y: 0 }, { x: 1, y: 1 }]
 };
 

[Survived] UnaryOperator
GameOfLife/src/utils/PatternUtil.ts:8:19
 const glider: PatternType = {
     id: 1,
     name: "Glider",
-    points: [{ x: -1, y: 0 }, { x: 0, y: 1 }, { x: 1, y: - 1 }, { x: 1, y: 0 }, { x: 1, y: 1 }]
+    points: [{ x: +1, y: 0 }, { x: 0, y: 1 }, { x: 1, y: - 1 }, { x: 1, y: 0 }, { x: 1, y: 1 }]
 };
 

[Survived] UnaryOperator
GameOfLife/src/utils/PatternUtil.ts:14:60
 const exploder: PatternType = {
     id: 2,
     name: "Exploder",
-    points: [{ x: -1, y: -1 }, { x: -1, y: 1 }, { x: 0, y: -1 }, { x: 0, y: 1 }, { x: 1, y: -1 }, { x: 1, y: 1 }, { x: 2, y: 0 }]
+    points: [{ x: -1, y: -1 }, { x: -1, y: 1 }, { x: 0, y: +1 }, { x: 0, y: 1 }, { x: 1, y: -1 }, { x: 1, y: 1 }, { x: 2, y: 0 }]
 };
 

[Survived] UnaryOperator
GameOfLife/src/utils/PatternUtil.ts:14:37
 const exploder: PatternType = {
     id: 2,
     name: "Exploder",
-    points: [{ x: -1, y: -1 }, { x: -1, y: 1 }, { x: 0, y: -1 }, { x: 0, y: 1 }, { x: 1, y: -1 }, { x: 1, y: 1 }, { x: 2, y: 0 }]
+    points: [{ x: -1, y: -1 }, { x: +1, y: 1 }, { x: 0, y: -1 }, { x: 0, y: 1 }, { x: 1, y: -1 }, { x: 1, y: 1 }, { x: 2, y: 0 }]
 };
 

[Survived] UnaryOperator
GameOfLife/src/utils/PatternUtil.ts:20:19
 const spaceship: PatternType = {
     id: 3,
     name: "Spaceship",
-    points: [{ x: -2, y: -1 }, { x: -2, y: 0 }, { x: -2, y: 1 }, { x: -2, y: 2 }, { x: -1, y: -2 }, { x: -1, y: 2 }, { x: 0, y: 2 }, { x: 1, y: -2 }, { x: 1, y: 1 }]
+    points: [{ x: +2, y: -1 }, { x: -2, y: 0 }, { x: -2, y: 1 }, { x: -2, y: 2 }, { x: -1, y: -2 }, { x: -1, y: 2 }, { x: 0, y: 2 }, { x: 1, y: -2 }, { x: 1, y: 1 }]
 };
 

[Survived] UnaryOperator
GameOfLife/src/utils/PatternUtil.ts:20:37
 const spaceship: PatternType = {
     id: 3,
     name: "Spaceship",
-    points: [{ x: -2, y: -1 }, { x: -2, y: 0 }, { x: -2, y: 1 }, { x: -2, y: 2 }, { x: -1, y: -2 }, { x: -1, y: 2 }, { x: 0, y: 2 }, { x: 1, y: -2 }, { x: 1, y: 1 }]
+    points: [{ x: -2, y: -1 }, { x: +2, y: 0 }, { x: -2, y: 1 }, { x: -2, y: 2 }, { x: -1, y: -2 }, { x: -1, y: 2 }, { x: 0, y: 2 }, { x: 1, y: -2 }, { x: 1, y: 1 }]
 };
 

[Survived] UnaryOperator
GameOfLife/src/utils/PatternUtil.ts:26:60
 const cellRows10: PatternType = {
     id: 4,
     name: "10 Cell Row",
-    points: [{ x: 0, y: - 4 }, { x: 0, y: -3 }, { x: 0, y: -2 }, { x: 0, y: -1 }, { x: 0, y: 0 }, { x: 0, y: 1 }, { x: 0, y: 2 }, { x: 0, y: 3 }, { x: 0, y: 4 }, { x: 0, y: 5 }]
+    points: [{ x: 0, y: - 4 }, { x: 0, y: -3 }, { x: 0, y: +2 }, { x: 0, y: -1 }, { x: 0, y: 0 }, { x: 0, y: 1 }, { x: 0, y: 2 }, { x: 0, y: 3 }, { x: 0, y: 4 }, { x: 0, y: 5 }]
 };
 

[Survived] UnaryOperator
GameOfLife/src/utils/PatternUtil.ts:26:25
 const cellRows10: PatternType = {
     id: 4,
     name: "10 Cell Row",
-    points: [{ x: 0, y: - 4 }, { x: 0, y: -3 }, { x: 0, y: -2 }, { x: 0, y: -1 }, { x: 0, y: 0 }, { x: 0, y: 1 }, { x: 0, y: 2 }, { x: 0, y: 3 }, { x: 0, y: 4 }, { x: 0, y: 5 }]
+    points: [{ x: 0, y: +4 }, { x: 0, y: -3 }, { x: 0, y: -2 }, { x: 0, y: -1 }, { x: 0, y: 0 }, { x: 0, y: 1 }, { x: 0, y: 2 }, { x: 0, y: 3 }, { x: 0, y: 4 }, { x: 0, y: 5 }]
 };
 

[Survived] ArrayDeclaration
GameOfLife/src/utils/PatternUtil.ts:29:45
     points: [{ x: 0, y: - 4 }, { x: 0, y: -3 }, { x: 0, y: -2 }, { x: 0, y: -1 }, { x: 0, y: 0 }, { x: 0, y: 1 }, { x: 0, y: 2 }, { x: 0, y: 3 }, { x: 0, y: 4 }, { x: 0, y: 5 }]
 };
 
-export const patterns: Array<PatternType> = [
-    glider, exploder, spaceship, cellRows10
-];
+export const patterns: Array<PatternType> = [];
